# Создать класс TrafficLight (светофор).
# определить у него один атрибут color (цвет) и метод running (запуск);
# атрибут реализовать как приватный;
# в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
# продолжительность первого состояния (красный) составляет 7 секунд,
# второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
# переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
# проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов.
# При его нарушении выводить соответствующее сообщение и завершать скрипт.

import time
class TrafficLight:
    def __init__(self, color):
        self.__color = color

    def running(self):
        print(self.__color)

step_1 = TrafficLight('red')
step_1.running()
time.sleep(7)
step_1 = TrafficLight('yellow')
step_1.running()
time.sleep(2)
step_1 = TrafficLight('green')
step_1.running()
time.sleep(5)